-- 商店相关配置
ServerGame.PoliFire = {
  drop_range = 1.5,  -- 掉落范围
  item_disp_time = 300,  -- 道具消失时间
  default_skill = 91001001,  -- 默认技能
--  item_skill = {
--    {710125,91002001}, -- 加速
--	{710126,91003001}, -- 护盾
--	{710127,91004001}, -- 突进
--	{710128,91005001}, -- 闪现
--	{710129,91006001}, -- 击退
--	{710130,91007001}, -- 香蕉皮
--	{710131,91009001}, -- 隐身
--	{710132,91010001}, -- 恶作剧
--	{710133,91012001}, -- 贪吃鬼
--	{710134,91013001}, -- 变大	
--  },  -- 道具id与技能id关联关系
  max_skill_pos = 6,  -- 最大技能数量
  gold_apple_id = 157,  -- 金苹果道具id
  ghost_poli_buff = 200090,  -- 变身幽灵波利buffid
  recover_num = 2,  -- 幽灵波利复活所需金苹果
  default_score = 4,        --开局拥有的金苹果数量
--   trans_buffid = {200100,200101,200102,200103,200104,200105,200106,200107,200108,200109},    --变身十个波利buffid
  god_buffid = 200052,      --无敌buffid
  god_duration = 11, --无敌持续时间
  apple_limit_count = 600, --积分上限
  score_itemid = 158,  --积分对应的道具id
  level_reward = {{59,40066},{79,40067},{99,40068},{110,40084}},  --等级对应的奖励id
  show_buff = 200200,  --金苹果数量显示BUFF
  mask_buff = {1170,100500},  --波利乱斗中屏蔽的buffid
  pre_close_msgtime = 20  --倒计时
}