--【改动任何内容都请单独改动每个分支下的配置文件条目，禁止偷懒直接将整个文件从一个分支复制到另外一个分支！】
--【配置表下按类别拆分，新内容如有必要则按格式重建一个配置表单独对应！】

ServerGame.Manual = {
  head_item_return_mail = 1010,
  card_item_return_mail = 1011,
  head_unlock_return_mail = 1012,
  card_unlock_return_mail = 1013,
  level_return_mail = 1008,
  quality_return_mail = 1014,
  skill_return_mail = 1009,
  unsolvedphoto_overtime = 1728000, -- 临时相册过期时间(单位:秒)

  level_return = {[10] = 2, [15] = 5, [20] = 10, [25] = 15, [30] = 20, [35] = 30},
  quality_return = {
    [1] = {[3] = {6021,1}, [6] = {6021,2}, [10] = {6021,3}, [20] = {6021,6}, [30] = {6021,10}, [50] = {6021,15}},
    [2] = {[3] = {6022,1}, [6] = {6022,2}, [10] = {6022,3}, [20] = {6022,4}, [30] = {6022,6}, [50] = {6022,8}},
    [3] = {[2] = {6022,1}, [5] = {6022,2}, [10] = {6022,3}, [20] = {6023,2}, [30] = {6023,3}, [40] = {6023,4}, [50] = {6024,2}},
    [4] = {[2] = {6025,1}, [5] = {6025,2}, [10] = {6024,2}, [20] = {6024,3}, [30] = {6024,4}},
  },
  quality_name = {
  [1] = "白色",
  [2] = "绿色",
  [3] = "蓝色",
  [4] = "紫色",
  }
}

