--【改动任何内容都请单独改动每个分支下的配置文件条目，禁止偷懒直接将整个文件从一个分支复制到另外一个分支！】
--【配置表下按类别拆分，新内容如有必要则按格式重建一个配置表单独对应！】

-- 公会
ServerGame.Guild = {
  default_npc_count = 5,
  npc_clear_time = 172800,--npc刷新时间48小时
  quest_protect_time = 86400,--任务保护时间，24小时
  maintenance_protect_lv = 4,--公会降级等级保护
  newicon_ntf_lv = {1, 9},--新icon提示公会等级
  -- photo_max_show = 32,--公会墙：最大照片显示数量
  photo_max_permember = 10,--公会墙：成员最大展示数量
  -- photo_max_horizontal = 25,--公会墙：最大横向照片数量
  -- photo_max_vertical = 7,--公会墙：最大竖向照片数量
  photo_refresh_time = 180,--公会墙：照片刷新间隔
  photo_frame = {101,102,103,104,105,106,107,110,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,207},
  photo_member_active_day = 7, --公会墙：成员要求活跃天数 
  photo_max_frame_photo = 30,--公会墙：最大相框照片数量 
  city_giveup_cd = 7200,
  auth_name = {[1] = "邀请入会", [2] = "批准入会", [3] = "申请列表删除", [4] = "编辑公告", [5] = "编辑招募",
            [6] = "变更图标", [7] = "公会升级", [8] = "公会建筑升级", [9] = "公会科技升级", [10] = "发布任务",
            [11] = "踢出会员", [12] = "踢出副会长", [13] = "变更职位", [14] = "编辑职位名字", [15] = "会长交接",
            [16] = "解散公会", [17] = "公会搬家", [18] = "开启异界", [19] = "照片墙"}
}

