ServerGame.Credit = {
  default_value = 0,			-- os備註有錯別字或者看不懂的請聯繫重熙...這個是初始值
  max_value = 50000,			-- 信用值上限設為50000

  dec_limit_value = 10000,		-- 信用值超過10000
  dec_day_value = 1000,			-- 每天第一次上线扣1000

  monster_value = 1,			-- 擊殺一隻魔物獲得信用
  max_monster_value = 500,		-- 擊殺魔物的每日信用上限
  mini_value = 100,			-- 擊殺一只mini獲得的信用值
  mvp_value = 100,				-- 擊殺一只MVP獲得的信用值

  wantedquest_value = 10,		-- 完成一次看板任務增加的信用值
  wantedquest_times = 10,		-- 每日完獲得的獲得次數上限
  seal_value = 100,				-- 每次完成裂隙增加的信用值
  seal_times = 5,				-- 每日完成裂隙的獲得次數上限

  charge_ratio = 10,			-- 充值一元錢獲得的信用值增加
  buy_ratio = 1000,				-- 交易所購買價格除以此數值=信用值

  add_interval = 3600,			-- 間隔3600秒
  interval_value = 10,			-- 增加信用值10點

  first_bad_value = 10,			-- 初次發送扣除10
  second_bad_value = 10,		-- 比上次懲罰增加10
  bad_interval = 30,			-- 兩次發送敏感字間隔時間30

  repeat_dec_value = 10,		-- 第二次重複說話扣除10
  repeat_interval = 60,			-- 發送間隔時間

  value_limit_personal = 0,		-- 小於0時自言自語模式，服務端不公告
  value_forbid = -300,			-- 當到達-300時，開啟帳號禁言
  time_forbid = 3600,			-- 禁言時間

  check_channel = {1, 2, 3, 4, 5, 6, 7, 8, 8, 10},  --發給我不要忘
  -- 以下是敏感字庫，運營同學請自便
  bad_strs = {"钻","月","微","薇","Q","淘宝","taobao","淘","宝","氵匋",
  "壹","贰","叁","肆","陆","柒","捌","玖","群","君羊","萬","薇信","Αρρух５","V辛宫",
  "内部一百","内部一折","appyx","WWT896","sk888g","WK6136","cgsy65","SHOPP6","818s","xx9999",
  "100=2000万Zeny","专业代练","微宫纵","薇公众","宫纵浩","辛宫纵號","微信zzzpai001","专业DL","APPSYNB","WS4579",
  "冤枉钱","威信","v信","Z闭","加秋","加丘","加抠","加扣","v9866v","Va876s","WK6131",
  "裸聊","玩裸","果照","黄网","黄片","陪裸","V心","工纵","储值","装背","纵浩","亻言","牜勿诚心要","6648","9718",
  "收Z","出z","棺祝","ooo旺","澫Z","澫","syg","On9gamer2","yunyx3","game8765"," ts888k","74519","0006","妆呗",
  "新获","官住","寻求长期合作伙伴","WX886X","淘手游","收号","１２４５９","７１１７７","到咐","612953945","ESMC7263","挂单","代充","有偿带",
"收费带","版本最快","老板咨询","诚信经营","sy568d","V信公众","送极品装备","送卡片套装",
"ndsc85O6","公众V信","V信","SEAGM","先带后付","有偿带","带老板","收费带","老板咨询","www.SEA","wvvw.SEA","wwvv.SEA","GM.COM","M.COM","dai充yue卡",
"bf888s","hipstar","sy568T","13178277823","f888wy","JBDXBL","51312,sy568T","活动价","slbz","mycqz","送宝箱","送礼包","专业友情",
"13178277823","ShouFei","shoufei","SHOUFEI","LXSY868","28280","sy568d","腾Q","自带比例","骗子绕道","代刷","大量出","官方金币","出金",
"此号已挂","估价群","预估","驱魔带妖道","专业友情","带友情","手工不耗疲劳","500友情=30R","加w信","283864217","支持各种交易","支持各种交Y",
"sy568d","XXSY868","LXSY868","sy568d","f888wy","JBDXBL","sy568T","sy568T","bf888s","hipstar","x888sy","fimi22","f888wy","JBDXBL","51312","sy568T","活动价","slbz","mycqz","送宝箱",
"送礼包","bf888s","hipstar","sy568T","13178277823","x888sy","pingguobang520","500友情","带练","带刷","代刷","接友情","30042513","fimi22","先刷后付","xoxocp","专业友情","13178277823",
"ShouFei","shoufei","SHOUFEI","LXSY868","28280","sy568d","腾Q","sy568d","估价","力口","XXSY868","公众","ndsc85O6","自带比例","骗子绕道","代刷","大量出","官方金币","出金","此号已挂","估价群","预估"},
  switch_punish = 1,			--這個是處罰的開關，開關包含自言自語和禁言

  black_value = 1,
  chat_save_req = 1, 			--這個沒有用
  chat_save_char_count = 3, --保存最大人数
  chat_save_max_count = 5000,		--保存的记录最大上限 代码里限制了最大5000？
  chat_calc_max_count = 50, --最大保存列表

  default_lv_value = {
    {min = 1, max = 10, value = 0},		--一次性更新系統時使用 等級預設信用值
    {min = 11, max = 40, value = 1000},
    {min = 41, max = 70, value = 10000},
    {min = 71, max = 100, value = 30000},
  }
}
