--【改动任何内容都请单独改动每个分支下的配置文件条目，禁止偷懒直接将整个文件从一个分支复制到另外一个分支！】
--【配置表下按类别拆分，新内容如有必要则按格式重建一个配置表单独对应！】

ServerGame.Lottery = {
  DayBuyLotteryGiveCnt = 50,    --扭蛋每天购买的赠送盒数量
  Price = 30,     --扭蛋一次的价格
  Discount = 30,  --当月的折扣，30表示折扣30%

  --ItemType对应当前批次
  Batch = {

[1] = 7,
[2] = 7,
[3] = 2,
[4] = 7,
[5] = 2,
[6] = 2,
[7] = 7,
[8] = 2,
[9] = 2,
[10] = 2,
[11] = 2,
[12] = 2,
[13] = 2,
[14] = 2,
[15] = 2,
[16] = 2,
[17] = 2,

  },
  
  --B格猫金币和B格猫福利券权重
  --往期类别 = 100 + 当期类别
  CoinWeight = { -- B格猫金币大类权重
    [103] = 10, --绝版头饰
    [104] = 10, --绝版武器
    [105] = 20, --绝版特典
    [1] = 200, --最新皮肤
    [101] = 20, --过往皮肤
    [2] = 1000, --最新头饰
    [102] = 100, --过往头饰
    [110] = 500, --发型
    [118] = 500, --时装染色
    [109] = 1000, --美瞳
    [111] = 800, --料理
    [106] = 600, --血迹树枝
    [7] = 1000, --最新时装碎片
    [117] = 900, --Zeny+残页
    [112] = 650, --货币
    [113] = 640, --便捷
    [114] = 350, --宠物
    [115] = 500, --经验
    [116] = 600, --祈祷
    [108] = 500, --卡片
    [107] = 0, --过往时装碎片
    [4] = 100, --最新武器



  },  
  TicketWeight = {  -- B格猫福利券大类权重  
    [103] = 10, --绝版头饰
    [104] = 10, --绝版武器
    [105] = 20, --绝版特典
    [1] = 100, --最新皮肤
    [101] = 10, --过往皮肤
    [2] = 500, --最新头饰
    [102] = 100, --过往头饰
    [110] = 740, --发型
    [118] = 740, --时装染色
    [109] = 1240, --美瞳
    [111] = 1040, --料理
    [106] = 300, --血迹树枝
    [7] = 500, --最新时装碎片
    [117] = 450, --Zeny+残页
    [112] = 890, --货币
    [113] = 880, --便捷
    [114] = 590, --宠物
    [115] = 740, --经验
    [116] = 840, --祈祷
    [108] = 250, --卡片
    [107] = 0, --过往时装碎片
    [4] = 50, --最新武器



  },  
  DayMaxCount = {     --每日金币扭蛋的最大次数
    [1] = 50, --头饰
    [2] = 50, --装备
    [3] = 50, --卡片
    [5] = 50, --活动
  },
  BasePriceRateMin = 250,-----保底抽取最小倍率2.5
  BasePriceRateMax = 350,-----保底抽取最大倍率3.5
  SaveRateMax = 50000,-----概率值小于等于该值是保存

  Linkage = {
   {type=1,year=2018,month=6,end_time="2018-11-30 5:00:00"},
  }--联动扭蛋关闭时间
}

 